---
kind: property
id: P:Autodesk.Revit.DB.GeometryObject.IsElementGeometry
source: html/be3ad18d-a9d3-25ed-6200-4f71d3cd4754.htm
---
# Autodesk.Revit.DB.GeometryObject.IsElementGeometry Property

Indicates whether this geometry is obtained directly from an Element.

## Syntax (C#)
```csharp
public bool IsElementGeometry { get; }
```